Core/src/Documents/Бюджет/Бюджет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Бюджет</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыПрогноз</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваПрогноз</registerRecords>
  <registerRecords>AccumulationRegister.ФинансовыйРезультатПрогноз</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийПланирования</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Остатки</name>
    <attributes>
      <name>Счет</name>
      <comment>Счет</comment>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетРегл</name>
      <comment>Счет</comment>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрямыеЗатраты</name>
    <attributes>
      <name>ДатаПланирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчет</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КосвенныеЗатраты</name>
    <attributes>
      <name>ДатаПланирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчет</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поступления</name>
    <attributes>
      <name>ДатаПланирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчет</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Выбытия</name>
    <attributes>
      <name>ДатаПланирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчет</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Доходы</name>
    <attributes>
      <name>ДатаПланирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчет</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчетРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>ДатаПланирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчет</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчетРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>ДенежниеСредства</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>ДатаПланирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/AccumulationRegisters/ДенежныеСредстваПрогноз/ДенежныеСредстваПрогноз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваПрогноз</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаПриход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПриходВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасходВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СценарийПланирования</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/ДоходыИРасходыПрогноз/ДоходыИРасходыПрогноз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоходыИРасходыПрогноз</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаДоходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СценарийПланирования</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Documents/Бюджет/ObjectModule.bsl
//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОбработчикиСобытий

//Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	
//	Если ОбменДанными.Загрузка Тогда
//		Возврат;
//	КонецЕсли;

//	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
//		
//		Для каждого СтрокаДоходы из Доходы Цикл
//			
//			Если СтрокаДоходы.Счет.ТипСчета = Перечисления.ТипыСчетов.ПрочиеДоходы Тогда
//				СтрокаДоходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
//			Иначе
//				СтрокаДоходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//		Для каждого СтрокаРасходы из Расходы Цикл
//			
//			Если СтрокаРасходы.Счет.ТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы
//				ИЛИ СтрокаРасходы.Счет.ТипСчета = Перечисления.ТипыСчетов.ПроцентыПоКредитам Тогда
//				СтрокаРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
//			Иначе
//				СтрокаРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//КонецПроцедуры // ПередЗаписью()

//Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//	
//	Для каждого СтрокаДоходы Из Доходы Цикл
//	
//		Если СтрокаДоходы.Счет.ТипСчета = Перечисления.ТипыСчетов.Доходы Тогда
//			
//			Если НЕ ЗначениеЗаполнено(СтрокаДоходы.СтруктурнаяЕдиница) Тогда
//				
//				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
//					ЭтотОбъект, 
//					"В строке не указано подразделение. Для доходов по основным видам деятельности заполнение обязательно.",
//					"Доходы",
//					СтрокаДоходы.НомерСтроки,
//					"СтруктурнаяЕдиница",
//					Отказ
//				);
//				
//			КонецЕсли;
//			
//		КонецЕсли;
//		
//		Если СтрокаДоходы.Счет.ТипСчета = Перечисления.ТипыСчетов.ПрочиеДоходы Тогда
//			
//			Если ЗначениеЗаполнено(СтрокаДоходы.НаправлениеДеятельности) И (СтрокаДоходы.НаправлениеДеятельности <> Справочники.НаправленияДеятельности.Прочее) Тогда
//				
//				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
//					ЭтотОбъект, 
//					"В строке указано направление деятельности отличное от 'Прочее'. Для прочих доходов требуется указание прочего вида деятельности.",
//					"Доходы",
//					СтрокаДоходы.НомерСтроки,
//					"НаправлениеДеятельности",
//					Отказ
//				);
//				
//			КонецЕсли;
//			
//			Если ЗначениеЗаполнено(СтрокаДоходы.СтруктурнаяЕдиница) Тогда
//				
//				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
//					ЭтотОбъект, 
//					"В строке указано подразделение. Для доходов по прочим видам деятельности заполнение не требуется.",
//					"Доходы",
//					СтрокаДоходы.НомерСтроки,
//					"СтруктурнаяЕдиница",
//					Отказ
//				);
//				
//			КонецЕсли;
//			
//		КонецЕсли;
//	
//	КонецЦикла;
//	
//	Для каждого СтрокаРасходы Из Расходы Цикл
//		
//		Если СтрокаРасходы.Счет.ТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы
//		 ИЛИ СтрокаРасходы.Счет.ТипСчета = Перечисления.ТипыСчетов.ПроцентыПоКредитам Тогда
//			
//			Если НЕ ЗначениеЗаполнено(СтрокаРасходы.НаправлениеДеятельности) Тогда
//				
//				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
//					ЭтотОбъект,
//					"В строке не указано направление деятельности.",
//					"Расходы",
//					СтрокаРасходы.НомерСтроки,
//					"НаправлениеДеятельности",
//					Отказ
//				);
//				
//			КонецЕсли;
//			
//			Если ЗначениеЗаполнено(СтрокаРасходы.НаправлениеДеятельности) И (СтрокаРасходы.НаправлениеДеятельности <> Справочники.НаправленияДеятельности.Прочее) Тогда
//				
//				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
//					ЭтотОбъект,
//					"В строке указано направление деятельности отличное от 'Прочее'. Для прочих расходов требуется указание прочего вида деятельности.",
//					"Расходы",
//					СтрокаРасходы.НомерСтроки,
//					"НаправлениеДеятельности",
//					Отказ
//				);
//				
//			КонецЕсли;
//			
//			Если ЗначениеЗаполнено(СтрокаРасходы.СтруктурнаяЕдиница) Тогда
//				
//				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
//					ЭтотОбъект, 
//					"В строке указано подразделение. Для расходов по прочим видам деятельности заполнение не требуется.",
//					"Расходы",
//					СтрокаРасходы.НомерСтроки,
//					"СтруктурнаяЕдиница",
//					Отказ
//				);
//				
//			КонецЕсли;
//			
//		Иначе
//			
//		КонецЕсли;
//		
//		Если СтрокаРасходы.Счет.ТипСчета = Перечисления.ТипыСчетов.СебестоимостьПродаж Тогда
//			
//			Если Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() И
//				(НЕ ЗначениеЗаполнено(СтрокаРасходы.НаправлениеДеятельности) ИЛИ (СтрокаРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее)) Тогда
//				
//				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
//					ЭтотОбъект,
//					"В строке не указано основное направление деятельности. Для себестоимости продаж требуется указание основного вида деятельности.",
//					"Расходы",
//					СтрокаРасходы.НомерСтроки,
//					"НаправлениеДеятельности",
//					Отказ
//				);
//				
//			КонецЕсли;
//			
//			Если НЕ ЗначениеЗаполнено(СтрокаРасходы.СтруктурнаяЕдиница) Тогда
//				
//				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
//					ЭтотОбъект, 
//					"В строке не указано подразделение. Для себестоимости продаж по основным видам деятельности заполнение обязательно.",
//					"Расходы",
//					СтрокаРасходы.НомерСтроки,
//					"СтруктурнаяЕдиница",
//					Отказ
//				);
//				
//			КонецЕсли;
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//КонецПроцедуры // ОбработкаПроверкиЗаполнения()

//Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
//	
//	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
//	
//КонецПроцедуры

Процедура  ОбработкаПроведения (Отказ, РежимПроведения)
	
	
	  ДенежныеСредстваПрогнозПоступления(Отказ, РежимПроведения);
	  ДенежныеСредстваПрогнозВыбытия(Отказ, РежимПроведения);
	  ДоходыИРасходыПрогнозДоходы(Отказ, РежимПроведения);
	  ДоходыИРасходыПрогнозРасходы(Отказ, РежимПроведения);
	  ФинансовыйРезультатПрогнозДоходы(Отказ, РежимПроведения);
	  ФинансовыйРезультатПрогнозРасходы(Отказ, РежимПроведения);
	  
	
КонецПроцедуры

Процедура ДенежныеСредстваПрогнозПоступления(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДенежныеСредстваПрогноз 
	Движения.ДенежныеСредстваПрогноз.Записывать = Истина;
	Для Каждого ТекСтрокаПоступления Из Поступления Цикл
		Движение = Движения.ДенежныеСредстваПрогноз.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СценарийПланирования = СценарийПланирования;
		Движение.Статья = ТекСтрокаПоступления.Статья;
		Движение.СчетУчетаРегл = ТекСтрокаПоступления.СчетРегл;
		Движение.Проект = Проект;
		Движение.СуммаПриход = ТекСтрокаПоступления.Сумма;
		Движение.Валюта = Константы.ВалютаУчета.Получить();
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры // ОбработкаПроведения()

Процедура ДенежныеСредстваПрогнозВыбытия(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДенежныеСредстваПрогноз 
	Движения.ДенежныеСредстваПрогноз.Записывать = Истина;
	Для Каждого ТекСтрокаВыбытия Из Выбытия Цикл
		Движение = Движения.ДенежныеСредстваПрогноз.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СценарийПланирования = СценарийПланирования;
		Движение.Статья = ТекСтрокаВыбытия.Статья;
		Движение.СчетУчетаРегл = ТекСтрокаВыбытия.СчетРегл;
		Движение.Проект = Проект;
		Движение.СуммаРасход = ТекСтрокаВыбытия.Сумма;
		Движение.Валюта = Константы.ВалютаУчета.Получить();
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры // ОбработкаПроведения()






Процедура ДоходыИРасходыПрогнозДоходы(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр ДенежныеСредстваПрогноз 
	Движения.ДоходыИРасходыПрогноз.Записывать = Истина;
	Для Каждого ТекСтрокаДоходы Из Доходы Цикл
		Движение = Движения.ДоходыИРасходыПрогноз.Добавить();
		Движение.Период = ТекСтрокаДоходы.ДатаПланирования;		
		Движение.Организация = Организация;
		Движение.СценарийПланирования = СценарийПланирования;
		Движение.СтруктурнаяЕдиница = ТекСтрокаДоходы.СтруктурнаяЕдиница;
		Движение.НаправлениеДеятельности = ТекСтрокаДоходы.НаправлениеДеятельности;
		Движение.ЗаказПокупателя = ТекСтрокаДоходы.ЗаказПокупателя;
		Движение.Проект = Проект;
		Движение.СчетУчетаРегл = ТекСтрокаДоходы.КоррСчетРегл;		
		Движение.СуммаДоходов = ТекСтрокаДоходы.Сумма;
		
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры 

Процедура ДоходыИРасходыПрогнозРасходы(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр ДенежныеСредстваПрогноз 
	Движения.ДоходыИРасходыПрогноз.Записывать = Истина;
	Для Каждого ТекСтрокаРасходы Из Расходы Цикл
		Движение = Движения.ДоходыИРасходыПрогноз.Добавить();
		Движение.Период = ТекСтрокаРасходы.ДатаПланирования;
		Движение.Организация = Организация;
		Движение.СценарийПланирования = СценарийПланирования;
		Движение.СтруктурнаяЕдиница = ТекСтрокаРасходы.СтруктурнаяЕдиница;
		Движение.НаправлениеДеятельности = ТекСтрокаРасходы.НаправлениеДеятельности;
		Движение.ЗаказПокупателя = ТекСтрокаРасходы.ЗаказПокупателя;
		Движение.Проект = Проект;
		Движение.СчетУчетаРегл = ТекСтрокаРасходы.КоррСчетРегл;		
		Движение.СуммаРасходов = ТекСтрокаРасходы.Сумма;
		
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры 



Процедура ФинансовыйРезультатПрогнозДоходы(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр ДенежныеСредстваПрогноз 
	Движения.ФинансовыйРезультатПрогноз.Записывать = Истина;
	Для Каждого ТекСтрокаДоходы Из Доходы Цикл
		Движение = Движения.ДоходыИРасходыПрогноз.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СценарийПланирования = СценарийПланирования;
		Движение.СтруктурнаяЕдиница = ТекСтрокаДоходы.СтруктурнаяЕдиница;
		Движение.НаправлениеДеятельности = ТекСтрокаДоходы.НаправлениеДеятельности;
		Движение.ЗаказПокупателя = ТекСтрокаДоходы.ЗаказПокупателя;
		Движение.СчетУчета = ТекСтрокаДоходы.КоррСчет;
		Движение.Проект = Проект;
		Движение.СчетУчетаРегл = ТекСтрокаДоходы.КоррСчетРегл;
		Движение.СуммаДоходов = ТекСтрокаДоходы.Сумма;

		
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры 

Процедура ФинансовыйРезультатПрогнозРасходы(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр ДенежныеСредстваПрогноз 
	Движения.ФинансовыйРезультатПрогноз.Записывать = Истина;
	Для Каждого ТекСтрокаРасходы Из Расходы Цикл
		Движение = Движения.ФинансовыйРезультатПрогноз.Добавить();
		Движение.Период = ТекСтрокаРасходы.ДатаПланирования;
		Движение.Организация = Организация;
		Движение.СценарийПланирования = СценарийПланирования;
		Движение.СтруктурнаяЕдиница = ТекСтрокаРасходы.СтруктурнаяЕдиница;
		Движение.НаправлениеДеятельности = ТекСтрокаРасходы.НаправлениеДеятельности;
		Движение.Проект = Проект;
		Движение.СчетУчетаРегл = ТекСтрокаРасходы.КоррСчетРегл;		
		Движение.СуммаРасходов = ТекСтрокаРасходы.Сумма;
		
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры 










//Процедура ОбработкаУдаленияПроведения(Отказ)
//	
//	// Инициализация дополнительных свойств для проведения документа
//	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
//	
//	// Подготовка наборов записей
//	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
//	
//	// Запись наборов записей
//	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
//	
//КонецПроцедуры // ОбработкаУдаленияПроведения()

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

////// Добавляет дополнительные реквизиты, необходимые для проведения документа в
////// переданную структуру.
//////
////// Параметры:
//////  СтруктураДополнительныеСвойства - Структура дополнительных свойств документа.
//////
//Процедура ДобавитьРеквизитыВДополнительныеСвойстваДляПроведения(СтруктураДополнительныеСвойства)
//	
//	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("СценарийПланирования", СценарийПланирования);
//	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("Периодичность", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СценарийПланирования, "Периодичность"));
//	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ДатаНачала", ДатаНачала);
//	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ДатаОкончания", ДатаОкончания);
//	
//КонецПроцедуры // ДобавитьРеквизитыВДополнительныеСвойстваДляПроведения()

////#КонецОбласти

//#КонецЕсли
